amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
static bool is_valid_name(const char *s)
{
    if (!s || s[0] == '\0')
        return false;
    for (int i = 0; s[i]; i++)
    {
        char c = s[i];
        if (c < 32 || c > 126)
            return false;
    }
    return true;
}

static void load_device_name(void)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t marker = EEPROM.read(EEPROM_NAME_ADDR);
    if (marker == 0xFF)
    {
        char buf[EEPROM_NAME_MAX];
        for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
        {
            buf[i] = EEPROM.read(EEPROM_NAME_ADDR + 1 + i);
            if (buf[i] == '\0')
                break;
        }
        buf[EEPROM_NAME_MAX - 1] = '\0';
        if (is_valid_name(buf))
        {
            strncpy(s_device_name, buf, sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
        }
    }
    EEPROM.end();
}

static void save_wifi_credentials(const char *ssid, const char *pass)
{
    EEPROM.begin(EEPROM_SIZE);
    EEPROM.write(EEPROM_SSID_ADDR, 0xFF);
    EEPROM.write(EEPROM_PASS_ADDR, 0xFF);
    for (int i = 0; i < EEPROM_SSID_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_SSID_ADDR + 1 + i, ssid[i]);
        if (ssid[i] == '\0')
            break;
    }
    EEPROM.write(EEPROM_SSID_ADDR + EEPROM_SSID_MAX - 1, '\0');
    for (int i = 0; i < EEPROM_PASS_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_PASS_ADDR + 1 + i, pass[i]);
        if (pass[i] == '\0')
            break;
    }
    EEPROM.write(EEPROM_PASS_ADDR + EEPROM_PASS_MAX - 1, '\0');
    EEPROM.commit();
    EEPROM.end();
}

static bool load_wifi_credentials(char *ssid, size_t ssid_size, char *pass, size_t pass_size)
{
    EEPROM.begin(EEPROM_SIZE);
    uint8_t marker = EEPROM.read(EEPROM_SSID_ADDR);
    bool found = false;
    if (marker == 0xFF)
    {
        char buf[64];
        for (int i = 0; i < EEPROM_SSID_MAX - 1; i++)
        {
            buf[i] = EEPROM.read(EEPROM_SSID_ADDR + 1 + i);
            if (buf[i] == '\0')
                break;
        }
        buf[EEPROM_SSID_MAX - 1] = '\0';
        if (strlen(buf) > 0)
        {
            strncpy(ssid, buf, ssid_size - 1);
            ssid[ssid_size - 1] = '\0';
            found = true;
        }
        marker = EEPROM.read(EEPROM_PASS_ADDR);
        if (marker == 0xFF)
        {
            for (int i = 0; i < EEPROM_PASS_MAX - 1; i++)
            {
                buf[i] = EEPROM.read(EEPROM_PASS_ADDR + 1 + i);
                if (buf[i] == '\0')
                    break;
            }
            buf[EEPROM_PASS_MAX - 1] = '\0';
            strncpy(pass, buf, pass_size - 1);
            pass[pass_size - 1] = '\0';
        }
    }
    EEPROM.end();
    return found;
}

static bool mac_parse(const char *str, uint8_t *mac)
{
    int vals[6];
    if (sscanf(str, "%x:%x:%x:%x:%x:%x",
               &vals[0], &vals[1], &vals[2],
               &vals[3], &vals[4], &vals[5]) != 6)
        return false;
    for (int i = 0; i < 6; i++)
        mac[i] = (uint8_t)vals[i];
    return true;
}

static void set_relay(bool state);

static void name_to_ssid(const char *name, char *out, size_t max)
{
    size_t j = 0;
    for (size_t i = 0; name[i] && j < max - 1; i++)
    {
        char c = name[i];
        if (c >= 32 && c <= 126 && c != '"' && c != '\\')
            out[j++] = c;
    }
    while (j > 0 && out[j - 1] == ' ')
        j--;
    if (j == 0)
    {
        strncpy(out, "Lampada", max - 1);
        out[max - 1] = '\0';
        return;
    }
    out[j] = '\0';
}

extern "C" void espnow_send_cb(uint8_t *mac, uint8_t status)
{
    s_espnow_tx_count++;
    if (status != 0)
    {
        char mac_str[18];
        mac_to_str(mac, mac_str, sizeof(mac_str));
        console.printf("[%s] ESPNOW send failed to %s: status=%d\n", TAG, mac_str, status);
    }
}

extern "C" void espnow_recv_cb(uint8_t *mac, uint8_t *data, uint8_t len)
{
    s_espnow_rx_count++;
    if (!data || len < 1)
        return;

    switch (data[0])
    {
    case ESPNOW_MSG_PAIR_RESPONSE:
    {
        if (len < sizeof(espnow_pair_response_t))
            return;
        espnow_pair_response_t *resp = (espnow_pair_response_t *)data;
        if (resp->status == PAIR_STATUS_OK)
        {
            if (!s_use_repeater)
            {
                mac_copy(s_gateway_mac, mac);
                save_gateway_mac(mac);
            }
            s_assigned_slot = resp->assigned_slot;
            s_paired = true;
            s_gateway_connected = true;
            char mac_str[18];
            mac_to_str(mac, mac_str, sizeof(mac_str));
            console.printf("[%s] Paired with gateway %s slot %d\n", TAG, mac_str, s_assigned_slot);
        }
        else
        {
            console.printf("[%s] Pair response: status=%d\n", TAG, resp->status);
        }
        break;
    }
    case ESPNOW_MSG_COMMAND:
    {
        if (len < sizeof(espnow_command_t))
            return;
        espnow_command_t *cmd = (espnow_command_t *)data;
        if (mac_equal(cmd->target_mac, s_my_mac))
        {
            console.printf("[%s] Command for me: state=%d\n", TAG, cmd->command);
            set_relay(cmd->command ? true : false);
        }
        break;
    }
    case ESPNOW_MSG_TIME_SYNC:
    {
        if (len < sizeof(espnow_time_sync_t))
            return;
        espnow_time_sync_t *ts = (espnow_time_sync_t *)data;
        s_synced_epoch = ts->epoch_seconds;
        console.printf("[%s] Time sync: epoch=%lu seq=%d\n", TAG, s_synced_epoch, ts->sequence);
        break;
    }
    case ESPNOW_MSG_ACK:
    {
        if (len < sizeof(espnow_ack_t))
            return;
        espnow_ack_t *ack = (espnow_ack_t *)data;
        console.printf("[%s] ACK received: status=%d seq=%d slot=%d\n", TAG, ack->status, ack->sequence, ack->assigned_slot);
        if (ack->status == PAIR_STATUS_DENIED)
        {
            s_paired = false;
            s_gateway_connected = false;
            console.printf("[%s] Gateway rejected data (denied), need re-pair\n", TAG);
        }
        else
        {
            s_gateway_connected = true;
        }
        s_ack_received = true;
        break;
    }
    }

    /* Repeater: forward messages between clients and gateway */
    if (s_paired && s_use_repeater)
    {
        if (mac_equal(mac, s_gateway_mac))
        {
            /* From gateway → broadcast (other devices check target_mac) */
            esp_now_send(s_broadcast_mac, data, len);
            s_repeater_fwd++;
        }
        else
        {
            /* From client → forward to gateway */
            track_repeater_client(mac);
            esp_now_send(s_gateway_mac, data, len);
            s_repeater_fwd++;
        }
    }
}

static bool espnow_init_client(void)
{
    if (esp_now_init() != 0)
    {
        console.printf("[%s] ESP-NOW init failed\n", TAG);
        return false;
    }
    esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
    esp_now_register_send_cb(espnow_send_cb);
    esp_now_register_recv_cb(espnow_recv_cb);
    s_espnow_ready = true;
    console.printf("[%s] ESP-NOW initialized\n", TAG);
    return true;
}

static bool espnow_add_peer(const uint8_t *mac)
{
    if (!s_espnow_ready)
        return false;
    esp_now_del_peer((uint8_t *)mac);
    int ch = ESP_NOW_CHANNEL;
    int ret = esp_now_add_peer((uint8_t *)mac, ESP_NOW_ROLE_COMBO, ch, NULL, 0);
    if (ret != 0)
    {
        char mac_str[18];
        mac_to_str(mac, mac_str, sizeof(mac_str));
        console.printf("[%s] Failed to add peer %s: %d\n", TAG, mac_str, ret);
    }
    return (ret == 0);
}

