amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
static void handle_api_restart(void)
{
    s_server.send(200, "application/json", "{\"status\":\"ok\"}");
    delay(500);
    ESP.restart();
}

static void handle_ota(void)
{
    if (!Update.hasError())
    {
        s_server.send(200, "application/json", "{\"status\":\"ok\"}");
        delay(500);
        ESP.restart();
    }
    else
    {
        s_server.send(500, "application/json", "{\"status\":\"error\"}");
    }
}

static void handle_ota_upload(void)
{
    HTTPUpload &upload = s_server.upload();
    if (upload.status == UPLOAD_FILE_START)
    {
        console.printf("[%s] OTA update started: %s (%d bytes)\n", TAG, upload.filename.c_str(), upload.totalSize);
        if (!Update.begin(upload.totalSize))
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        if (Update.end(true))
            console.printf("[%s] OTA update success: %d bytes\n", TAG, upload.totalSize);
        else
            Update.printError(Serial);
    }
}

void setup(void)
{
    Serial.begin(115200);
    delay(1000);
    console.begin();
    s_start_time = millis();

    uint32_t chip_id = ESP.getChipId();
    snprintf(s_device_id, sizeof(s_device_id), "esp8266_%06x", chip_id);

    load_device_name();

    console.printf("\n");
    console.printf("============================================\n");
    console.printf("  ESP8266 Lampada " FW_VERSION "\n");
    console.printf("  Device: %s\n", s_device_id);
    console.printf("  Nome:   %s\n", s_device_name);
    console.printf("============================================\n");

    randomSeed(analogRead(A0));
    init_hardware();
    console.printf("============================================\n");

    hwifi_begin();

    espnow_init_client();
    WiFi.macAddress(s_my_mac);

    s_alexa_dev = new EspalexaDevice(s_device_name, alexa_callback, EspalexaDeviceType::onoff);
    s_alexa.addDevice(s_alexa_dev);
    s_alexa.begin(&s_server);
    console.printf("[%s] Alexa Hue Bridge: %s ready\n", TAG, s_device_name);

    s_server.on("/", handle_root);
    s_server.on("/docs", []()
                { s_server.send(200, "text/html", FPSTR(PAGE_DOCS)); });
    s_server.on("/api/wifi", HTTP_ANY, handle_api_wifi);
    s_server.on("/api/state", handle_api_state);
    s_server.on("/api/relay", handle_api_relay);
    s_server.on("/api/pin", HTTP_ANY, handle_api_pin);
    s_server.on("/api/settings", HTTP_ANY, handle_api_settings);
    s_server.on("/api/timers", HTTP_ANY, handle_api_timers);
    s_server.on("/api/timer/next", handle_api_timer_next);
    s_server.on("/api/restart", HTTP_POST, handle_api_restart);
    s_server.on("/api/ota", HTTP_POST, handle_ota, handle_ota_upload);
    /* s_server.begin() is called by Espalexa internally */

    ArduinoOTA.setHostname(s_device_id);
    ArduinoOTA.onStart([]()
                       { console.printf("[%s] OTA update start\n", TAG); });
    ArduinoOTA.onEnd([]()
                     { console.printf("[%s] OTA update end\n", TAG); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                          { console.printf("[%s] OTA progress: %u%%\r", TAG, (progress * 100) / total); });
    ArduinoOTA.onError([](ota_error_t error)
                       { console.printf("[%s] OTA error: %d\n", TAG, error); });
    ArduinoOTA.begin();
    console.printf("[%s] OTA ready: %s.local\n", TAG, s_device_id);

    console.printf("  => Terminal:  'h' comando de ajuda\n");

    /* Check for REPEATER_MAC from config.h */
    if (strlen(REPEATER_MAC) > 0 && mac_parse(REPEATER_MAC, s_gateway_mac))
    {
        s_use_repeater = true;
        s_paired = true;
        char mac_str[18];
        mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
        console.printf("[%s] Using repeater MAC: %s\n", TAG, mac_str);
    }
    else if (load_gateway_mac())
    {
        console.printf("[%s] Gateway MAC loaded from EEPROM\n", TAG);
        s_paired = true;
    }
    else
    {
        console.printf("[%s] No saved gateway MAC, will pair\n", TAG);
    }

    timer_init();
    timer_load();
    console.printf("  Timers:  %d configurados\n", MAX_TIMERS);

    console.printf("============================================\n");
    console.printf("  Pronto! Pressione 'h' para ajuda\n");
    console.printf("  Telnet: %s:23\n", WiFi.localIP().toString().c_str());
    console.printf("============================================\n\n");
}

void loop(void)
{
    console.loop();
    if (Serial.available() > 0)
    {
        handle_console(Serial.read());
    }
    if (console.telnet_available() > 0)
    {
        handle_console(console.telnet_read());
    }
    handle_wifi();
    ArduinoOTA.handle();
    s_alexa.loop();

    {
        bool btn = digitalRead(s_button_pin);
        unsigned long now = millis();
        if (btn != s_button_last && now - s_button_last_ms > 50)
        {
            s_button_last_ms = now;
            s_button_last = btn;
            if (btn == LOW)
            {
                toggle_relay();
                console.printf("[%s] Button press -> relay %s\n", TAG, s_relay_state ? "ON" : "OFF");
            }
        }
    }

    unsigned long now = millis();

    if (!s_paired)
    {
        if (s_pair_wait_until > 0 && now < s_pair_wait_until)
            return;
        if (now - s_last_espnow_pair > ESPNOW_PAIR_INTERVAL_MS)
        {
            s_last_espnow_pair = now;
            s_pair_attempts++;
            console.printf("[%s] Pair attempt %d/%d\n", TAG, s_pair_attempts, ESPNOW_MAX_PAIR_ATTEMPTS);
            espnow_send_pair_request();
            if (s_pair_attempts >= ESPNOW_MAX_PAIR_ATTEMPTS)
            {
                s_pair_attempts = 0;
                s_pair_wait_until = now + 5000;
                console.printf("[%s] Max pair attempts, waiting 60s\n", TAG);
            }
        }
        return;
    }

    if (s_send_pending)
    {
        if (s_ack_received)
        {
            s_send_pending = false;
            s_gateway_connected = true;
            s_last_send_ms = millis();
        }
        else if (now > s_send_deadline)
        {
            if (s_send_retries_left > 0)
            {
                s_send_retries_left--;
                s_ack_received = false;
                if (espnow_send_data())
                    s_send_deadline = millis() + ESPNOW_ACK_TIMEOUT_MS;
                else
                    s_send_pending = false;
            }
            else
            {
                s_send_pending = false;
                s_gateway_connected = false;
                console.printf("[%s] Send failed, re-pairing\n", TAG);
                s_paired = false;
                s_pair_attempts = 0;
                s_last_espnow_pair = 0;
            }
        }
    }

    if (!s_send_pending && now - s_last_espnow_send > STATE_UPDATE_INTERVAL)
    {
        s_last_espnow_send = now;
        s_ack_received = false;
        if (espnow_send_data())
        {
            s_send_pending = true;
            s_send_deadline = now + ESPNOW_ACK_TIMEOUT_MS;
            s_send_retries_left = ESPNOW_SEND_RETRIES;
        }
    }

    if (now - s_last_heartbeat > HEARTBEAT_INTERVAL)
    {
        s_last_heartbeat = now;
        console.printf("[%s] RSSI=%d dBm  up=%lus\n", TAG, WiFi.RSSI(), (millis() - s_start_time) / 1000);
        if (s_paired)
            espnow_send_heartbeat();
    }

    {
        static unsigned long last_timer_check = 0;
        if (now - last_timer_check > TIMER_CHECK_INTERVAL_MS)
        {
            last_timer_check = now;
            if (WiFi.status() == WL_CONNECTED)
            {
                int action = timer_check(get_epoch(), s_timezone_offset);
                if (action >= 0)
                {
                    apply_timer(action);
                    s_last_espnow_send = 0;
                }
            }
        }
    }

#ifdef LED_PIN
    static unsigned long last_led = 0;
    if (!s_led_enabled)
    {
        digitalWrite(LED_PIN, LED_OFF);
    }
    else if (s_config_portal_active)
    {
        digitalWrite(LED_PIN, LED_ON);
    }
    else if (WiFi.status() != WL_CONNECTED)
    {
        if (now - last_led >= LED_BLINK_WIFI_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else if (!s_paired)
    {
        if (now - last_led >= LED_BLINK_GATEWAY_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else
    {
        digitalWrite(LED_PIN, LED_OFF);
    }
#endif

}
